Repository: AhmedKamalCom/Ahmed-Kamal-EAmanahTask
Catalog: AmanahTask.Localization/Shared/SharedResource.*.resx
Languages: ar

source: Already Exists
ar: موجود من قبل

source: Already Used Coupon With Same Customer
ar: الكوبون مستخدم من قبل مع هذا العميل

source: Coupon Code Already Exist
ar: يوجد كوبون بنفس الكود

source: Delete Account NotAllowed BecauseOf EntryDetails
ar: لا يمكن مسح الحساب لانه مستخدم مع بعض القيود

source: Delete Bank NotAllowed BecauseOF Stores
ar: لا يمكن مسح البنك لانه موجود في عدة مخازن

source: Delete Category Not Allowed BecauseOF Items
ar: لا يمكن مسح التصنيف لانه مستخدم في الاصناف

source: Delete CostCenter NotAllowed BecauseOf Accounts
ar: لا يمكن مسح مركز التكلفة لانه مستخدم مع بعض الحسابات

source: Delete Customer NotAllowed BecauseOF StoreDocuments
ar: لا يمكن مسح العميل لانه موجود في عمليات مخزنية

source: Delete Department NotAllowed BecauseOf Employees
ar: لا يمكن مسح القسم لانه مستخدم مع بعض الموظفين

source: Delete Employee NotAllowed BecauseOF Sales
ar: لا يمكن مسح الموظف لانه موجود في عملية بيع

source: Delete Employee NotAllowed BecauseOF Stores
ar: لا يمكن مسح الموظف لانه موجود في مخزن

source: Delete FiscalYear NotAllowed BecauseOf Entries
ar: لا يمكن مسح السنة المالية لانها مستخدمة في بعض القيود

source: Delete Item Not Allowed Because OF BuffetPreparationItems
ar: لا يمكن مسح الصنف لانه موجود في طلب وليمة

source: Delete Item Not Allowed Because OF Card Size Items
ar: لا يمكن مسح الصنف لانه مكون في وجبة

source: Delete Item Not Allowed Because OF Store Request Details
ar: لا يمكن مسح الصنف لانه موجود في طلب أصناف من مخزن

source: Delete Job NotAllowed BecauseOf Employees
ar: لا يمكن مسح الوظيفة لانها مستخدمة مع بعض الموظفين

source: Delete Store Not Allowed BecauseOf ItemTransactions
ar: لا يمكن مسح المخزن لانه مستخدم في بعض الحركات المخزنية

source: Delete Store Not Allowed BecauseOf Kitchens
ar: لا يمكن مسح المخزن لانه مستخدم في بعض المطابخ

source: Delete Store Not Allowed BecauseOf StoreDocuments
ar: لا يمكن مسح المخزن لانه مستخدم في بعض اذونات الصرف

source: Delete Store Not Allowed BecauseOf StoreRequests
ar: لا يمكن مسح المخزن لانه مستخدم في بعض طلب اذونات الصرف

source: Delete Store Not Allowed BecauseOf Treasuries
ar: لا يمكن مسح المخزن لانه مستخدم في بعض الخزن

source: Delete StoreRequest Not Allowed BecauseOf StoreDocuments
ar: لا يمكن مسح طلب اذن الصرف لانه مستخدم في اذن صرف

source: Delete Supplier NotAllowed BecauseOF StoreDocuments
ar: لا يمكن مسح المورد لانه موجود في عمليات مخزنية

source: Delete Treasury NotAllowed BecauseOF CashDocuments
ar: لا يمكن مسح الخزينة لانه مستخدم في عملية دفع

source: Delete Treasury NotAllowed BecauseOF Store
ar: لا يمكن مسح الخزينة لانه مستخدم في مخزن

source: Delete Unit Not Allowed BecauseOf ItemTransactions
ar: لا يمكن مسح الوحدة المخزنية لانه مستخدم في عملية مخزنية

source: Delete Unit NotAllowed BecauseOf ItemUnits
ar: لا يمكن مسح الوحدة المخزنية لانه مستخدم كوحدة في صنف

source: Error Occurred
ar: حدث خطأ ما

source: Invalid field length
ar: عدد الحروف غير مناسب

# InValidUser
source: Invalid username or password
ar: خطأ فى إسم الدخول أو كلمة المرور

source: No CostCenter For This Branch
ar: لايوجد مركز تكلفه لهذا الفرع

# NotMapped
source: Error During Account Mapping.
ar: حدث خطأ أثناء عملية ربط الحسابات

# OrderIsPaid
source: Order has been Paid
ar: لا يمكنك التعديل علي هذا الطلب حيث انه قد تم دفعه

source: Quantity Not Enough
ar: الكمية غير كافية

source: Required field
ar: حقل مطلوب

source: Required Field Validation
ar: هذا الحقل مطلوب

source: StoreDoument Delete Not Allowed BecauseOf StoreDocuments
ar: لا يمكن مسح طلب اذون الصرف لانه مستخدم في اذن استلام

source: Successfully created
ar: تم الإضافة بنجاح

source: Successfully Deleted
ar: تم الحذف بنجاح

source: Successfully Posted
ar: تم الاعتماد بنجاح

source: Successfully Registered
ar: تم التسجيل بنجاح

source: Successfully Sended
ar: تم الارسال بنجاح

source: Successfully Updated
ar: تم التعديل بنجاح

source: valdation code sent to email
ar: تم ارسال كود اعادة تعيين كلمه المرور إلى البريد الالكترونى

source: welcome
ar: أهلا بك
